01  WS-AREA-1 PIC X(100). 01  WS-AREA-2 PIC 9(5). 01  WS-OVERFLOW-FLAG PIC 9 VALUE 0. ADD 1 TO WS-AREA-2 ON SIZE ERROR SET WS-OVERFLOW-FLAG TO 1. IF WS-OVERFLOW-FLAG = 1 THEN MOVE 'Overflow Error' TO WS-AREA-1 ELSE MOVE WS-AREA-2 TO WS-AREA-1.